xsession/openocd/svd/dspic33fj128mc804.svd
<?xml version='1.0' encoding='utf-8'?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Microchip</vendor>
  <vendorID>Microchip</vendorID>
  <name>dsPIC33FJ128MC804</name>
  <series>dsPIC33FJ</series>
  <version>1.0</version>
  <description>Microchip dsPIC33FJ128MC804 dsPIC Digital Signal Controller</description>
  <licenseText>Derived from Microchip Device Family Pack data; see metadata.</licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>16</width>
  <size>16</size>
  <access>read-write</access>
  <resetValue>0x0</resetValue>
  <resetMask>0xffff</resetMask>
  <peripherals>
    <peripheral>
      <name>SFR</name>
      <description>Special Function Register data space</description>
      <groupName>SFR</groupName>
      <baseAddress>0x0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x776</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>INT0Interrupt</name>
        <description>INT0 - External Interrupt 0</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>IC1Interrupt</name>
        <description>IC1 - Input Compare 1</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>OC1Interrupt</name>
        <description>OC1 - Output Compare 1</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>T1Interrupt</name>
        <description>T1 - Timer1</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA0Interrupt</name>
        <description>DMA0 - DMA Channel 0</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>IC2Interrupt</name>
        <description>IC2 - Input Capture 2</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>OC2Interrupt</name>
        <description>OC2 - Output Compare 2</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>T2Interrupt</name>
        <description>T2 - Timer2</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>T3Interrupt</name>
        <description>T3 - Timer3</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>SPI1ErrInterrupt</name>
        <description>SPI1E - SPI1 Error</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>U1TXInterrupt</name>
        <description>U1TX - UART1 Transmitter</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>ADC1Interrupt</name>
        <description>ADC1 - A/D Converter 1</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA1Interrupt</name>
        <description>DMA1 - DMA Channel 1</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>Interrupt15</name>
        <description>Reserved</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>SI2C1Interrupt</name>
        <description>SI2C1 - I2C1 Slave Events</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>MI2C1Interrupt</name>
        <description>MI2C1 - I2C1 Master Events</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>CMPInterrupt</name>
        <description>CMP - Comparator Interrupt</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>CNInterrupt</name>
        <description>Change Notification Interrupt</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>INT1Interrupt</name>
        <description>INT1 - External Interrupt 1</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>Interrupt21</name>
        <description>Reserved</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>IC7Interrupt</name>
        <description>IC7 - Input Capture 7</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>IC8Interrupt</name>
        <description>IC8 - Input Capture 8</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>DMA2Interrupt</name>
        <description>DMA2 - DMA Channel 2</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>OC3Interrupt</name>
        <description>OC3 - Output Compare 3</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>OC4Interrupt</name>
        <description>OC4 - Output Compare 4</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>T4Interrupt</name>
        <description>T4 - Timer4</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>T5Interrupt</name>
        <description>T5 - Timer5</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>INT2Interrupt</name>
        <description>INT2 - External Interrupt 2</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>U2RXInterrupt</name>
        <description>U2RX - UART2 Receiver</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>U2TXInterrupt</name>
        <description>U2TX - UART2 Transmitter</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>SPI2ErrInterrupt</name>
        <description>SPI2E - SPI2 Error</description>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>SPI2Interrupt</name>
        <description>SPI2 - SPI2 Transfer Done</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>C1RxRdyInterrupt</name>
        <description>C1RX-ECAN1 Receive Data Ready</description>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>C1Interrupt</name>
        <description>C1-ECAN1 Event</description>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>DMA3Interrupt</name>
        <description>DMA3 - DMA Channel 3</description>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>Interrupt37</name>
        <description>Reserved</description>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>Interrupt38</name>
        <description>Reserved</description>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>Interrupt39</name>
        <description>Reserved</description>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>Interrupt40</name>
        <description>Reserved</description>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>Interrupt41</name>
        <description>Reserved</description>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>Interrupt42</name>
        <description>Reserved</description>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>Interrupt43</name>
        <description>Reserved</description>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>Interrupt44</name>
        <description>Reserved</description>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>PMPInterrupt</name>
        <description>PMP - Parallel Master Port</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>DMA4Interrupt</name>
        <description>DMA4 - DMA Channel 4</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>Interrupt47</name>
        <description>Reserved</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>Interrupt48</name>
        <description>Reserved</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>Interrupt49</name>
        <description>Reserved</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>Interrupt50</name>
        <description>Reserved</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>Interrupt51</name>
        <description>Reserved</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>Interrupt52</name>
        <description>Reserved</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>Interrupt53</name>
        <description>Reserved</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>Interrupt54</name>
        <description>Reserved</description>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>Interrupt55</name>
        <description>Reserved</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>Interrupt56</name>
        <description>Reserved</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>MPWM1Interrupt</name>
        <description>MPWM1 - MPWM1 Period Match</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>QEI1Interrupt</name>
        <description>QEI1 - Positiono Counter Match</description>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>Interrupt59</name>
        <description>Reserved</description>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>Interrupt60</name>
        <description>Reserved</description>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>DMA5Interrupt</name>
        <description>DMA5 - DMA Channel 5</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>RTCCInterrupt</name>
        <description>RTCC - Real-Time Clock and Calendar</description>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>FLTA1Interrupt</name>
        <description>FLTA1 - MPWM1 Fault A</description>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>Interrupt64</name>
        <description>Reserved</description>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>U1ErrInterrupt</name>
        <description>U1E - UART1 Error</description>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>U2ErrInterrupt</name>
        <description>U2E - UART2 Error</description>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>CRCInterrupt</name>
        <description>CRC - Cyclic Redunancy Check</description>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>DMA6Interrupt</name>
        <description>DMA6 - DMA Channel 6</description>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>DMA7Interrupt</name>
        <description>DMA7 - DMA Channel 7</description>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>C1TxReqInterrupt</name>
        <description>C1TX-ECAN1 Transmit Data Request</description>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>Interrupt71</name>
        <description>Reserved</description>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>Interrupt72</name>
        <description>Reserved</description>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>MPWM2Interrupt</name>
        <description>MPWM2 - MPWM2 Period Match</description>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>FLTA2Interrupt</name>
        <description>FLTA2 - MPWM2 Fault A</description>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>QEI2Interrupt</name>
        <description>QEI2 - Positiono Counter Match</description>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>Interrupt76</name>
        <description>Reserved</description>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>Interrupt77</name>
        <description>Reserved</description>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>DAC1RInterrupt</name>
        <description>DaC1-Right Data Request</description>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>DAC1LInterrupt</name>
        <description>DaC1-Left Data Request</description>
        <value>79</value>
      </interrupt>
      <registers>
        <register>
          <name>WREG0</name>
          <displayName>WREG0</displayName>
          <description>WREG0</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG0</name>
              <description>WREG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG1</name>
          <displayName>WREG1</displayName>
          <description>WREG1</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG1</name>
              <description>WREG1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG2</name>
          <displayName>WREG2</displayName>
          <description>WREG2</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG2</name>
              <description>WREG2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG3</name>
          <displayName>WREG3</displayName>
          <description>WREG3</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG3</name>
              <description>WREG3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG4</name>
          <displayName>WREG4</displayName>
          <description>WREG4</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG4</name>
              <description>WREG4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC1STAT</name>
          <displayName>DAC1STAT</displayName>
          <description>DAC1STAT</description>
          <addressOffset>0xa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>REMPTY</name>
              <description>REMPTY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG6</name>
          <displayName>WREG6</displayName>
          <description>WREG6</description>
          <addressOffset>0xc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG6</name>
              <description>WREG6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG7</name>
          <displayName>WREG7</displayName>
          <description>WREG7</description>
          <addressOffset>0xe</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG7</name>
              <description>WREG7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG8</name>
          <displayName>WREG8</displayName>
          <description>WREG8</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG8</name>
              <description>WREG8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG9</name>
          <displayName>WREG9</displayName>
          <description>WREG9</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG9</name>
              <description>WREG9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG10</name>
          <displayName>WREG10</displayName>
          <description>WREG10</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG10</name>
              <description>WREG10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG11</name>
          <displayName>WREG11</displayName>
          <description>WREG11</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG11</name>
              <description>WREG11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG12</name>
          <displayName>WREG12</displayName>
          <description>WREG12</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG12</name>
              <description>WREG12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG13</name>
          <displayName>WREG13</displayName>
          <description>WREG13</description>
          <addressOffset>0x1a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG13</name>
              <description>WREG13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG14</name>
          <displayName>WREG14</displayName>
          <description>WREG14</description>
          <addressOffset>0x1c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WREG14</name>
              <description>WREG14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WREG15</name>
          <displayName>WREG15</displayName>
          <description>WREG15</description>
          <addressOffset>0x1e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>WREG15</name>
              <description>WREG15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLIM</name>
          <displayName>SPLIM</displayName>
          <description>SPLIM</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPLIM</name>
              <description>SPLIM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCAL</name>
          <displayName>ACCAL</displayName>
          <description>ACCAL</description>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCAL</name>
              <description>ACCAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
