xsession/openocd/svd/dspic33fj128mc804.svd
        <register>
          <name>ACCAH</name>
          <displayName>ACCAH</displayName>
          <description>ACCAH</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCAH</name>
              <description>ACCAH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCAU</name>
          <displayName>ACCAU</displayName>
          <description>ACCAU</description>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff00</resetMask>
          <fields>
            <field>
              <name>ACCAU</name>
              <description>ACCAU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBL</name>
          <displayName>ACCBL</displayName>
          <description>ACCBL</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCBL</name>
              <description>ACCBL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBH</name>
          <displayName>ACCBH</displayName>
          <description>ACCBH</description>
          <addressOffset>0x2a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ACCBH</name>
              <description>ACCBH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCBU</name>
          <displayName>ACCBU</displayName>
          <description>ACCBU</description>
          <addressOffset>0x2c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff00</resetMask>
          <fields>
            <field>
              <name>ACCBU</name>
              <description>ACCBU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCL</name>
          <displayName>PCL</displayName>
          <description>PCL</description>
          <addressOffset>0x2e</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PCL</name>
              <description>PCL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCH</name>
          <displayName>PCH</displayName>
          <description>PCH</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>PCH</name>
              <description>PCH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TBLPAG</name>
          <displayName>TBLPAG</displayName>
          <description>TBLPAG</description>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>TBLPAG</name>
              <description>TBLPAG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSVPAG</name>
          <displayName>PSVPAG</displayName>
          <description>PSVPAG</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>PSVPAG</name>
              <description>PSVPAG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCOUNT</name>
          <displayName>RCOUNT</displayName>
          <description>RCOUNT</description>
          <addressOffset>0x36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RCOUNT</name>
              <description>RCOUNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOUNT</name>
          <displayName>DCOUNT</displayName>
          <description>DCOUNT</description>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DCOUNT</name>
              <description>DCOUNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOSTARTL</name>
          <displayName>DOSTARTL</displayName>
          <description>DOSTARTL</description>
          <addressOffset>0x3a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DOSTARTL</name>
              <description>DOSTARTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOSTARTH</name>
          <displayName>DOSTARTH</displayName>
          <description>DOSTARTH</description>
          <addressOffset>0x3c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DOSTARTH</name>
              <description>DOSTARTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOENDL</name>
          <displayName>DOENDL</displayName>
          <description>DOENDL</description>
          <addressOffset>0x3e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DOENDL</name>
              <description>DOENDL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOENDH</name>
          <displayName>DOENDH</displayName>
          <description>DOENDH</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DOENDH</name>
              <description>DOENDH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>SR</description>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>C</name>
              <description>C</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CORCON</name>
          <displayName>CORCON</displayName>
          <description>CORCON</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0x1fff</resetMask>
          <fields>
            <field>
              <name>IF</name>
              <description>IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODCON</name>
          <displayName>MODCON</displayName>
          <description>MODCON</description>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcfff</resetMask>
          <fields>
            <field>
              <name>XWM</name>
              <description>XWM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODSRT</name>
          <displayName>XMODSRT</displayName>
          <description>XMODSRT</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>XS</name>
              <description>XS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODEND</name>
          <displayName>XMODEND</displayName>
          <description>XMODEND</description>
          <addressOffset>0x4a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>XE</name>
              <description>XE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>YMODSRT</name>
          <displayName>YMODSRT</displayName>
          <description>YMODSRT</description>
          <addressOffset>0x4c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>YS</name>
              <description>YS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>YMODEND</name>
          <displayName>YMODEND</displayName>
          <description>YMODEND</description>
          <addressOffset>0x4e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>YE</name>
              <description>YE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XBREV</name>
          <displayName>XBREV</displayName>
          <description>XBREV</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>XB</name>
              <description>XB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DISICNT</name>
          <displayName>DISICNT</displayName>
          <description>DISICNT</description>
          <addressOffset>0x52</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DISICNT</name>
              <description>DISICNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNEN1</name>
          <displayName>CNEN1</displayName>
          <description>CNEN1</description>
          <addressOffset>0x60</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CN0IE</name>
              <description>CN0IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNEN2</name>
          <displayName>CNEN2</displayName>
          <description>CNEN2</description>
          <addressOffset>0x62</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CN16IE</name>
              <description>CN16IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPU1</name>
          <displayName>CNPU1</displayName>
          <description>CNPU1</description>
          <addressOffset>0x68</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CN0PUE</name>
              <description>CN0PUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPU2</name>
          <displayName>CNPU2</displayName>
          <description>CNPU2</description>
          <addressOffset>0x6a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CN16PUE</name>
              <description>CN16PUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCON1</name>
          <displayName>INTCON1</displayName>
          <description>INTCON1</description>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OSCFAIL</name>
              <description>OSCFAIL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCON2</name>
          <displayName>INTCON2</displayName>
          <description>INTCON2</description>
          <addressOffset>0x82</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc007</resetMask>
          <fields>
            <field>
              <name>INT0EP</name>
              <description>INT0EP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0</name>
          <displayName>IFS0</displayName>
          <description>IFS0</description>
          <addressOffset>0x84</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INT0IF</name>
              <description>INT0IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1</name>
          <displayName>IFS1</displayName>
          <description>IFS1</description>
          <addressOffset>0x86</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffdf</resetMask>
          <fields>
            <field>
              <name>SI2C1IF</name>
              <description>SI2C1IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2</name>
          <displayName>IFS2</displayName>
          <description>IFS2</description>
          <addressOffset>0x88</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x601f</resetMask>
          <fields>
            <field>
              <name>SPI2EIF</name>
              <description>SPI2EIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS3</name>
          <displayName>IFS3</displayName>
          <description>IFS3</description>
          <addressOffset>0x8a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe600</resetMask>
          <fields>
            <field>
              <name>PWM1IF</name>
              <description>PWM1IF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS4</name>
          <displayName>IFS4</displayName>
          <description>IFS4</description>
          <addressOffset>0x8c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xce7e</resetMask>
          <fields>
            <field>
              <name>U1EIF</name>
              <description>U1EIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0</name>
          <displayName>IEC0</displayName>
          <description>IEC0</description>
          <addressOffset>0x94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>INT0IE</name>
              <description>INT0IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1</name>
          <displayName>IEC1</displayName>
          <description>IEC1</description>
          <addressOffset>0x96</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffdf</resetMask>
          <fields>
            <field>
              <name>SI2C1IE</name>
              <description>SI2C1IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2</name>
          <displayName>IEC2</displayName>
          <description>IEC2</description>
          <addressOffset>0x98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x601f</resetMask>
          <fields>
            <field>
              <name>SPI2EIE</name>
              <description>SPI2EIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC3</name>
          <displayName>IEC3</displayName>
          <description>IEC3</description>
          <addressOffset>0x9a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe600</resetMask>
          <fields>
            <field>
              <name>PWM1IE</name>
              <description>PWM1IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC4</name>
          <displayName>IEC4</displayName>
          <description>IEC4</description>
          <addressOffset>0x9c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xce7e</resetMask>
          <fields>
            <field>
              <name>U1EIE</name>
              <description>U1EIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
