xsession/openocd/svd/dspic33fj128mc804.svd
        <register>
          <name>I2C1STAT</name>
          <displayName>I2C1STAT</displayName>
          <description>I2C1STAT</description>
          <addressOffset>0x208</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc7ff</resetMask>
          <fields>
            <field>
              <name>TBF</name>
              <description>TBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1ADD</name>
          <displayName>I2C1ADD</displayName>
          <description>I2C1ADD</description>
          <addressOffset>0x20a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>I2C1ADD</name>
              <description>I2C1ADD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1MSK</name>
          <displayName>I2C1MSK</displayName>
          <description>I2C1MSK</description>
          <addressOffset>0x20c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>AMSK</name>
              <description>AMSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1MODE</name>
          <displayName>U1MODE</displayName>
          <description>U1MODE</description>
          <addressOffset>0x220</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbbff</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1STA</name>
          <displayName>U1STA</displayName>
          <description>U1STA</description>
          <addressOffset>0x222</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xefff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1TXREG</name>
          <displayName>U1TXREG</displayName>
          <description>U1TXREG</description>
          <addressOffset>0x224</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>UTXREG0</name>
              <description>UTXREG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1RXREG</name>
          <displayName>U1RXREG</displayName>
          <description>U1RXREG</description>
          <addressOffset>0x226</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>URXREG0</name>
              <description>URXREG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U1BRG</name>
          <displayName>U1BRG</displayName>
          <description>U1BRG</description>
          <addressOffset>0x228</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRG</name>
              <description>BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2MODE</name>
          <displayName>U2MODE</displayName>
          <description>U2MODE</description>
          <addressOffset>0x230</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbbff</resetMask>
          <fields>
            <field>
              <name>STSEL</name>
              <description>STSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2STA</name>
          <displayName>U2STA</displayName>
          <description>U2STA</description>
          <addressOffset>0x232</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x110</resetValue>
          <resetMask>0xefff</resetMask>
          <fields>
            <field>
              <name>URXDA</name>
              <description>URXDA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2TXREG</name>
          <displayName>U2TXREG</displayName>
          <description>U2TXREG</description>
          <addressOffset>0x234</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>UTXREG0</name>
              <description>UTXREG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2RXREG</name>
          <displayName>U2RXREG</displayName>
          <description>U2RXREG</description>
          <addressOffset>0x236</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>URXREG0</name>
              <description>URXREG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>U2BRG</name>
          <displayName>U2BRG</displayName>
          <description>U2BRG</description>
          <addressOffset>0x238</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRG</name>
              <description>BRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1STAT</name>
          <displayName>SPI1STAT</displayName>
          <description>SPI1STAT</description>
          <addressOffset>0x240</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa043</resetMask>
          <fields>
            <field>
              <name>SPIRBF</name>
              <description>SPIRBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON1</name>
          <displayName>SPI1CON1</displayName>
          <description>SPI1CON1</description>
          <addressOffset>0x242</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fff</resetMask>
          <fields>
            <field>
              <name>PPRE</name>
              <description>PPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON2</name>
          <displayName>SPI1CON2</displayName>
          <description>SPI1CON2</description>
          <addressOffset>0x244</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe002</resetMask>
          <fields>
            <field>
              <name>FRMDLY</name>
              <description>FRMDLY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1BUF</name>
          <displayName>SPI1BUF</displayName>
          <description>SPI1BUF</description>
          <addressOffset>0x248</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPI1BUF</name>
              <description>SPI1BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2STAT</name>
          <displayName>SPI2STAT</displayName>
          <description>SPI2STAT</description>
          <addressOffset>0x260</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa043</resetMask>
          <fields>
            <field>
              <name>SPIRBF</name>
              <description>SPIRBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON1</name>
          <displayName>SPI2CON1</displayName>
          <description>SPI2CON1</description>
          <addressOffset>0x262</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1fff</resetMask>
          <fields>
            <field>
              <name>PPRE</name>
              <description>PPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON2</name>
          <displayName>SPI2CON2</displayName>
          <description>SPI2CON2</description>
          <addressOffset>0x264</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe002</resetMask>
          <fields>
            <field>
              <name>FRMDLY</name>
              <description>FRMDLY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2BUF</name>
          <displayName>SPI2BUF</displayName>
          <description>SPI2BUF</description>
          <addressOffset>0x268</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SPI2BUF</name>
              <description>SPI2BUF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISA</name>
          <displayName>TRISA</displayName>
          <description>TRISA</description>
          <addressOffset>0x2c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x79f</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>TRISA0</name>
              <description>TRISA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTA</name>
          <displayName>PORTA</displayName>
          <description>PORTA</description>
          <addressOffset>0x2c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RA0</name>
              <description>RA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATA</name>
          <displayName>LATA</displayName>
          <description>LATA</description>
          <addressOffset>0x2c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>LATA0</name>
              <description>LATA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCA</name>
          <displayName>ODCA</displayName>
          <description>ODCA</description>
          <addressOffset>0x2c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x79f</resetMask>
          <fields>
            <field>
              <name>ODCA0</name>
              <description>ODCA0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISB</name>
          <displayName>TRISB</displayName>
          <description>TRISB</description>
          <addressOffset>0x2c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xffff</resetValue>
          <resetMask>0xffff</resetMask>
          <fields>
            <field>
              <name>TRISB0</name>
              <description>TRISB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTB</name>
          <displayName>PORTB</displayName>
          <description>PORTB</description>
          <addressOffset>0x2ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RB0</name>
              <description>RB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATB</name>
          <displayName>LATB</displayName>
          <description>LATB</description>
          <addressOffset>0x2cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LATB0</name>
              <description>LATB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCB</name>
          <displayName>ODCB</displayName>
          <description>ODCB</description>
          <addressOffset>0x2ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ODCB0</name>
              <description>ODCB0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISC</name>
          <displayName>TRISC</displayName>
          <description>TRISC</description>
          <addressOffset>0x2d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3ff</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>TRISC0</name>
              <description>TRISC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTC</name>
          <displayName>PORTC</displayName>
          <description>PORTC</description>
          <addressOffset>0x2d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>RC0</name>
              <description>RC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LATC</name>
          <displayName>LATC</displayName>
          <description>LATC</description>
          <addressOffset>0x2d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>LATC0</name>
              <description>LATC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCC</name>
          <displayName>ODCC</displayName>
          <description>ODCC</description>
          <addressOffset>0x2d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3ff</resetMask>
          <fields>
            <field>
              <name>ODCC0</name>
              <description>ODCC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCFG1</name>
          <displayName>PADCFG1</displayName>
          <description>PADCFG1</description>
          <addressOffset>0x2fc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>PMPTTL</name>
              <description>PMPTTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF0</name>
          <displayName>ADC1BUF0</displayName>
          <description>ADC1BUF0</description>
          <addressOffset>0x300</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADCBUF0</name>
              <description>ADCBUF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON1</name>
          <displayName>AD1CON1</displayName>
          <description>AD1CON1</description>
          <addressOffset>0x320</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xb7ef</resetMask>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2</name>
          <displayName>AD1CON2</displayName>
          <description>AD1CON2</description>
          <addressOffset>0x322</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe7bf</resetMask>
          <fields>
            <field>
              <name>ALTS</name>
              <description>ALTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3</name>
          <displayName>AD1CON3</displayName>
          <description>AD1CON3</description>
          <addressOffset>0x324</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9fff</resetMask>
          <fields>
            <field>
              <name>ADCS</name>
              <description>ADCS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHS123</name>
          <displayName>AD1CHS123</displayName>
          <description>AD1CHS123</description>
          <addressOffset>0x326</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x707</resetMask>
          <fields>
            <field>
              <name>CH123SA</name>
              <description>CH123SA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
