xsession/openocd/svd/dspic33fj128mc804.svd
        <register>
          <name>AD1CHS0</name>
          <displayName>AD1CHS0</displayName>
          <description>AD1CHS0</description>
          <addressOffset>0x328</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x9f9f</resetMask>
          <fields>
            <field>
              <name>CH0SA</name>
              <description>CH0SA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1PCFGL</name>
          <displayName>AD1PCFGL</displayName>
          <description>AD1PCFGL</description>
          <addressOffset>0x32c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>PCFG0</name>
              <description>PCFG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSL</name>
          <displayName>AD1CSSL</displayName>
          <description>AD1CSSL</description>
          <addressOffset>0x330</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>CSS0</name>
              <description>CSS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON4</name>
          <displayName>AD1CON4</displayName>
          <description>AD1CON4</description>
          <addressOffset>0x332</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>DMABL</name>
              <description>DMABL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0CON</name>
          <displayName>DMA0CON</displayName>
          <description>DMA0CON</description>
          <addressOffset>0x380</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0REQ</name>
          <displayName>DMA0REQ</displayName>
          <description>DMA0REQ</description>
          <addressOffset>0x382</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0STA</name>
          <displayName>DMA0STA</displayName>
          <description>DMA0STA</description>
          <addressOffset>0x384</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0STB</name>
          <displayName>DMA0STB</displayName>
          <description>DMA0STB</description>
          <addressOffset>0x386</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0PAD</name>
          <displayName>DMA0PAD</displayName>
          <description>DMA0PAD</description>
          <addressOffset>0x388</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0CNT</name>
          <displayName>DMA0CNT</displayName>
          <description>DMA0CNT</description>
          <addressOffset>0x38a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1CON</name>
          <displayName>DMA1CON</displayName>
          <description>DMA1CON</description>
          <addressOffset>0x38c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1REQ</name>
          <displayName>DMA1REQ</displayName>
          <description>DMA1REQ</description>
          <addressOffset>0x38e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STA</name>
          <displayName>DMA1STA</displayName>
          <description>DMA1STA</description>
          <addressOffset>0x390</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STB</name>
          <displayName>DMA1STB</displayName>
          <description>DMA1STB</description>
          <addressOffset>0x392</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1PAD</name>
          <displayName>DMA1PAD</displayName>
          <description>DMA1PAD</description>
          <addressOffset>0x394</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1CNT</name>
          <displayName>DMA1CNT</displayName>
          <description>DMA1CNT</description>
          <addressOffset>0x396</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2CON</name>
          <displayName>DMA2CON</displayName>
          <description>DMA2CON</description>
          <addressOffset>0x398</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2REQ</name>
          <displayName>DMA2REQ</displayName>
          <description>DMA2REQ</description>
          <addressOffset>0x39a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STA</name>
          <displayName>DMA2STA</displayName>
          <description>DMA2STA</description>
          <addressOffset>0x39c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STB</name>
          <displayName>DMA2STB</displayName>
          <description>DMA2STB</description>
          <addressOffset>0x39e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2PAD</name>
          <displayName>DMA2PAD</displayName>
          <description>DMA2PAD</description>
          <addressOffset>0x3a0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2CNT</name>
          <displayName>DMA2CNT</displayName>
          <description>DMA2CNT</description>
          <addressOffset>0x3a2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3CON</name>
          <displayName>DMA3CON</displayName>
          <description>DMA3CON</description>
          <addressOffset>0x3a4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3REQ</name>
          <displayName>DMA3REQ</displayName>
          <description>DMA3REQ</description>
          <addressOffset>0x3a6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STA</name>
          <displayName>DMA3STA</displayName>
          <description>DMA3STA</description>
          <addressOffset>0x3a8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STB</name>
          <displayName>DMA3STB</displayName>
          <description>DMA3STB</description>
          <addressOffset>0x3aa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3PAD</name>
          <displayName>DMA3PAD</displayName>
          <description>DMA3PAD</description>
          <addressOffset>0x3ac</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3CNT</name>
          <displayName>DMA3CNT</displayName>
          <description>DMA3CNT</description>
          <addressOffset>0x3ae</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4CON</name>
          <displayName>DMA4CON</displayName>
          <description>DMA4CON</description>
          <addressOffset>0x3b0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4REQ</name>
          <displayName>DMA4REQ</displayName>
          <description>DMA4REQ</description>
          <addressOffset>0x3b2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4STA</name>
          <displayName>DMA4STA</displayName>
          <description>DMA4STA</description>
          <addressOffset>0x3b4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4STB</name>
          <displayName>DMA4STB</displayName>
          <description>DMA4STB</description>
          <addressOffset>0x3b6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4PAD</name>
          <displayName>DMA4PAD</displayName>
          <description>DMA4PAD</description>
          <addressOffset>0x3b8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA4CNT</name>
          <displayName>DMA4CNT</displayName>
          <description>DMA4CNT</description>
          <addressOffset>0x3ba</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5CON</name>
          <displayName>DMA5CON</displayName>
          <description>DMA5CON</description>
          <addressOffset>0x3bc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5REQ</name>
          <displayName>DMA5REQ</displayName>
          <description>DMA5REQ</description>
          <addressOffset>0x3be</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5STA</name>
          <displayName>DMA5STA</displayName>
          <description>DMA5STA</description>
          <addressOffset>0x3c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5STB</name>
          <displayName>DMA5STB</displayName>
          <description>DMA5STB</description>
          <addressOffset>0x3c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA5PAD</name>
          <displayName>DMA5PAD</displayName>
          <description>DMA5PAD</description>
          <addressOffset>0x3c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
