xsession/openocd/svd/dspic33fj128mc804.svd
        <register>
          <name>DMA5CNT</name>
          <displayName>DMA5CNT</displayName>
          <description>DMA5CNT</description>
          <addressOffset>0x3c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6CON</name>
          <displayName>DMA6CON</displayName>
          <description>DMA6CON</description>
          <addressOffset>0x3c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6REQ</name>
          <displayName>DMA6REQ</displayName>
          <description>DMA6REQ</description>
          <addressOffset>0x3ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6STA</name>
          <displayName>DMA6STA</displayName>
          <description>DMA6STA</description>
          <addressOffset>0x3cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6STB</name>
          <displayName>DMA6STB</displayName>
          <description>DMA6STB</description>
          <addressOffset>0x3ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6PAD</name>
          <displayName>DMA6PAD</displayName>
          <description>DMA6PAD</description>
          <addressOffset>0x3d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA6CNT</name>
          <displayName>DMA6CNT</displayName>
          <description>DMA6CNT</description>
          <addressOffset>0x3d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7CON</name>
          <displayName>DMA7CON</displayName>
          <description>DMA7CON</description>
          <addressOffset>0x3d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf833</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7REQ</name>
          <displayName>DMA7REQ</displayName>
          <description>DMA7REQ</description>
          <addressOffset>0x3d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x807f</resetMask>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7STA</name>
          <displayName>DMA7STA</displayName>
          <description>DMA7STA</description>
          <addressOffset>0x3d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STA</name>
              <description>STA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7STB</name>
          <displayName>DMA7STB</displayName>
          <description>DMA7STB</description>
          <addressOffset>0x3da</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>STB</name>
              <description>STB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7PAD</name>
          <displayName>DMA7PAD</displayName>
          <description>DMA7PAD</description>
          <addressOffset>0x3dc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>PAD</name>
              <description>PAD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA7CNT</name>
          <displayName>DMA7CNT</displayName>
          <description>DMA7CNT</description>
          <addressOffset>0x3de</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7ff</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACS0</name>
          <displayName>DMACS0</displayName>
          <description>DMACS0</description>
          <addressOffset>0x3e0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>XWCOL</name>
              <description>XWCOL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACS1</name>
          <displayName>DMACS1</displayName>
          <description>DMACS1</description>
          <addressOffset>0x3e2</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0xf00</resetValue>
          <resetMask>0xfff</resetMask>
          <fields>
            <field>
              <name>PPST0</name>
              <description>PPST0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSADR</name>
          <displayName>DSADR</displayName>
          <description>DSADR</description>
          <addressOffset>0x3e4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DSADR</name>
              <description>DSADR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC1CON</name>
          <displayName>DAC1CON</displayName>
          <description>DAC1CON</description>
          <addressOffset>0x3f0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xb17f</resetMask>
          <fields>
            <field>
              <name>DACFDIV</name>
              <description>DACFDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC1DFLT</name>
          <displayName>DAC1DFLT</displayName>
          <description>DAC1DFLT</description>
          <addressOffset>0x3f4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DACDFLT</name>
              <description>DACDFLT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC1RDAT</name>
          <displayName>DAC1RDAT</displayName>
          <description>DAC1RDAT</description>
          <addressOffset>0x3f6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DACRDAT</name>
              <description>DACRDAT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC1LDAT</name>
          <displayName>DAC1LDAT</displayName>
          <description>DAC1LDAT</description>
          <addressOffset>0x3f8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DACLDAT</name>
              <description>DACLDAT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CTRL1</name>
          <displayName>C1CTRL1</displayName>
          <description>C1CTRL1</description>
          <addressOffset>0x400</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x200</resetValue>
          <resetMask>0x300</resetMask>
          <fields>
            <field>
              <name>WIN</name>
              <description>WIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CTRL2</name>
          <displayName>C1CTRL2</displayName>
          <description>C1CTRL2</description>
          <addressOffset>0x402</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DNCNT</name>
              <description>DNCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1VEC</name>
          <displayName>C1VEC</displayName>
          <description>C1VEC</description>
          <addressOffset>0x404</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x4</resetValue>
          <resetMask>0x4</resetMask>
          <fields>
            <field>
              <name>ICODE</name>
              <description>ICODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FCTRL</name>
          <displayName>C1FCTRL</displayName>
          <description>C1FCTRL</description>
          <addressOffset>0x406</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FSA</name>
              <description>FSA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFO</name>
          <displayName>C1FIFO</displayName>
          <description>C1FIFO</description>
          <addressOffset>0x408</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FNRB</name>
              <description>FNRB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1INTF</name>
          <displayName>C1INTF</displayName>
          <description>C1INTF</description>
          <addressOffset>0x40a</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TBIF</name>
              <description>TBIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1INTE</name>
          <displayName>C1INTE</displayName>
          <description>C1INTE</description>
          <addressOffset>0x40c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TBIE</name>
              <description>TBIE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1EC</name>
          <displayName>C1EC</displayName>
          <description>C1EC</description>
          <addressOffset>0x40e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RERRCNT</name>
              <description>RERRCNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CFG1</name>
          <displayName>C1CFG1</displayName>
          <description>C1CFG1</description>
          <addressOffset>0x410</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>BRP</name>
              <description>BRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1CFG2</name>
          <displayName>C1CFG2</displayName>
          <description>C1CFG2</description>
          <addressOffset>0x412</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PRSEG</name>
              <description>PRSEG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FEN1</name>
          <displayName>C1FEN1</displayName>
          <description>C1FEN1</description>
          <addressOffset>0x414</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>FLTEN</name>
              <description>FLTEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FMSKSEL1</name>
          <displayName>C1FMSKSEL1</displayName>
          <description>C1FMSKSEL1</description>
          <addressOffset>0x418</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F0MSK</name>
              <description>F0MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FMSKSEL2</name>
          <displayName>C1FMSKSEL2</displayName>
          <description>C1FMSKSEL2</description>
          <addressOffset>0x41a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F8MSK</name>
              <description>F8MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXFUL1</name>
          <displayName>C1RXFUL1</displayName>
          <description>C1RXFUL1</description>
          <addressOffset>0x420</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXFUL0</name>
              <description>RXFUL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXFUL2</name>
          <displayName>C1RXFUL2</displayName>
          <description>C1RXFUL2</description>
          <addressOffset>0x422</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXFUL16</name>
              <description>RXFUL16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT3</name>
          <displayName>C1BUFPNT3</displayName>
          <description>C1BUFPNT3</description>
          <addressOffset>0x424</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F8BP</name>
              <description>F8BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT4</name>
          <displayName>C1BUFPNT4</displayName>
          <description>C1BUFPNT4</description>
          <addressOffset>0x426</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>F12BP</name>
              <description>F12BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF1</name>
          <displayName>C1RXOVF1</displayName>
          <description>C1RXOVF1</description>
          <addressOffset>0x428</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXOVF0</name>
              <description>RXOVF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF2</name>
          <displayName>C1RXOVF2</displayName>
          <description>C1RXOVF2</description>
          <addressOffset>0x42a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RXOVF16</name>
              <description>RXOVF16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
