xsession/openocd/svd/dspic33fj128mc804.svd
        <register>
          <name>C1TR01CON</name>
          <displayName>C1TR01CON</displayName>
          <description>C1TR01CON</description>
          <addressOffset>0x430</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX0PRI</name>
              <description>TX0PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR23CON</name>
          <displayName>C1TR23CON</displayName>
          <description>C1TR23CON</description>
          <addressOffset>0x432</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX2PRI</name>
              <description>TX2PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR45CON</name>
          <displayName>C1TR45CON</displayName>
          <description>C1TR45CON</description>
          <addressOffset>0x434</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX4PRI</name>
              <description>TX4PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR67CON</name>
          <displayName>C1TR67CON</displayName>
          <description>C1TR67CON</description>
          <addressOffset>0x436</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>TX6PRI</name>
              <description>TX6PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2SID</name>
          <displayName>C1RXM2SID</displayName>
          <description>C1RXM2SID</description>
          <addressOffset>0x438</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID16</name>
              <description>EID16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2EID</name>
          <displayName>C1RXM2EID</displayName>
          <description>C1RXM2EID</description>
          <addressOffset>0x43a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID0</name>
              <description>EID0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXD</name>
          <displayName>C1RXD</displayName>
          <description>C1RXD</description>
          <addressOffset>0x440</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>C1RXD</name>
              <description>C1RXD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TXD</name>
          <displayName>C1TXD</displayName>
          <description>C1TXD</description>
          <addressOffset>0x442</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xfffe</resetMask>
          <fields>
            <field>
              <name>C1TXD</name>
              <description>C1TXD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1SID</name>
          <displayName>C1RXF1SID</displayName>
          <description>C1RXF1SID</description>
          <addressOffset>0x444</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1EID</name>
          <displayName>C1RXF1EID</displayName>
          <description>C1RXF1EID</description>
          <addressOffset>0x446</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2SID</name>
          <displayName>C1RXF2SID</displayName>
          <description>C1RXF2SID</description>
          <addressOffset>0x448</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2EID</name>
          <displayName>C1RXF2EID</displayName>
          <description>C1RXF2EID</description>
          <addressOffset>0x44a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3EID</name>
          <displayName>C1RXF3EID</displayName>
          <description>C1RXF3EID</description>
          <addressOffset>0x44e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4SID</name>
          <displayName>C1RXF4SID</displayName>
          <description>C1RXF4SID</description>
          <addressOffset>0x450</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4EID</name>
          <displayName>C1RXF4EID</displayName>
          <description>C1RXF4EID</description>
          <addressOffset>0x452</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5SID</name>
          <displayName>C1RXF5SID</displayName>
          <description>C1RXF5SID</description>
          <addressOffset>0x454</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6SID</name>
          <displayName>C1RXF6SID</displayName>
          <description>C1RXF6SID</description>
          <addressOffset>0x458</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6EID</name>
          <displayName>C1RXF6EID</displayName>
          <description>C1RXF6EID</description>
          <addressOffset>0x45a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF7SID</name>
          <displayName>C1RXF7SID</displayName>
          <description>C1RXF7SID</description>
          <addressOffset>0x45c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF7EID</name>
          <displayName>C1RXF7EID</displayName>
          <description>C1RXF7EID</description>
          <addressOffset>0x45e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF8SID</name>
          <displayName>C1RXF8SID</displayName>
          <description>C1RXF8SID</description>
          <addressOffset>0x460</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF8EID</name>
          <displayName>C1RXF8EID</displayName>
          <description>C1RXF8EID</description>
          <addressOffset>0x462</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF9SID</name>
          <displayName>C1RXF9SID</displayName>
          <description>C1RXF9SID</description>
          <addressOffset>0x464</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF9EID</name>
          <displayName>C1RXF9EID</displayName>
          <description>C1RXF9EID</description>
          <addressOffset>0x466</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF10SID</name>
          <displayName>C1RXF10SID</displayName>
          <description>C1RXF10SID</description>
          <addressOffset>0x468</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF10EID</name>
          <displayName>C1RXF10EID</displayName>
          <description>C1RXF10EID</description>
          <addressOffset>0x46a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF11SID</name>
          <displayName>C1RXF11SID</displayName>
          <description>C1RXF11SID</description>
          <addressOffset>0x46c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF11EID</name>
          <displayName>C1RXF11EID</displayName>
          <description>C1RXF11EID</description>
          <addressOffset>0x46e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF12SID</name>
          <displayName>C1RXF12SID</displayName>
          <description>C1RXF12SID</description>
          <addressOffset>0x470</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF12EID</name>
          <displayName>C1RXF12EID</displayName>
          <description>C1RXF12EID</description>
          <addressOffset>0x472</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF13SID</name>
          <displayName>C1RXF13SID</displayName>
          <description>C1RXF13SID</description>
          <addressOffset>0x474</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF13EID</name>
          <displayName>C1RXF13EID</displayName>
          <description>C1RXF13EID</description>
          <addressOffset>0x476</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF14SID</name>
          <displayName>C1RXF14SID</displayName>
          <description>C1RXF14SID</description>
          <addressOffset>0x478</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF14EID</name>
          <displayName>C1RXF14EID</displayName>
          <description>C1RXF14EID</description>
          <addressOffset>0x47a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF15SID</name>
          <displayName>C1RXF15SID</displayName>
          <description>C1RXF15SID</description>
          <addressOffset>0x47c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xffeb</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF15EID</name>
          <displayName>C1RXF15EID</displayName>
          <description>C1RXF15EID</description>
          <addressOffset>0x47e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EID</name>
              <description>EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2TCON</name>
          <displayName>P2TCON</displayName>
          <description>P2TCON</description>
          <addressOffset>0x5c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xa0ff</resetMask>
          <fields>
            <field>
              <name>PTMOD</name>
              <description>PTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2TMR</name>
          <displayName>P2TMR</displayName>
          <description>P2TMR</description>
          <addressOffset>0x5c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PTMR</name>
              <description>PTMR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2TPER</name>
          <displayName>P2TPER</displayName>
          <description>P2TPER</description>
          <addressOffset>0x5c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PTPER</name>
              <description>PTPER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
