xsession/openocd/svd/dspic33fj128mc804.svd
        <register>
          <name>P2SECMP</name>
          <displayName>P2SECMP</displayName>
          <description>P2SECMP</description>
          <addressOffset>0x5c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>SEVTCMP</name>
              <description>SEVTCMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM2CON1</name>
          <displayName>PWM2CON1</displayName>
          <description>PWM2CON1</description>
          <addressOffset>0x5c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x111</resetMask>
          <fields>
            <field>
              <name>PEN1L</name>
              <description>PEN1L</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM2CON2</name>
          <displayName>PWM2CON2</displayName>
          <description>PWM2CON2</description>
          <addressOffset>0x5ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf07</resetMask>
          <fields>
            <field>
              <name>UDIS</name>
              <description>UDIS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DTCON1</name>
          <displayName>P2DTCON1</displayName>
          <description>P2DTCON1</description>
          <addressOffset>0x5cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DTA</name>
              <description>DTA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DTCON2</name>
          <displayName>P2DTCON2</displayName>
          <description>P2DTCON2</description>
          <addressOffset>0x5ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>DTS1I</name>
              <description>DTS1I</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2FLTACON</name>
          <displayName>P2FLTACON</displayName>
          <description>P2FLTACON</description>
          <addressOffset>0x5d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x381</resetMask>
          <fields>
            <field>
              <name>FAEN1</name>
              <description>FAEN1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2OVDCON</name>
          <displayName>P2OVDCON</displayName>
          <description>P2OVDCON</description>
          <addressOffset>0x5d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0x303</resetMask>
          <fields>
            <field>
              <name>POUT1L</name>
              <description>POUT1L</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DC1</name>
          <displayName>P2DC1</displayName>
          <description>P2DC1</description>
          <addressOffset>0x5d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>P2DC1</name>
              <description>P2DC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCON</name>
          <displayName>PMCON</displayName>
          <description>PMCON</description>
          <addressOffset>0x600</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfef</resetMask>
          <fields>
            <field>
              <name>RDSP</name>
              <description>RDSP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMMODE</name>
          <displayName>PMMODE</displayName>
          <description>PMMODE</description>
          <addressOffset>0x602</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WAITE</name>
              <description>WAITE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMADDR</name>
          <displayName>PMADDR</displayName>
          <description>PMADDR</description>
          <addressOffset>0x604</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDOUT2</name>
          <displayName>PMDOUT2</displayName>
          <description>PMDOUT2</description>
          <addressOffset>0x606</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDIN1</name>
          <displayName>PMDIN1</displayName>
          <description>PMDIN1</description>
          <addressOffset>0x608</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMDIN2</name>
          <displayName>PMDIN2</displayName>
          <description>PMDIN2</description>
          <addressOffset>0x60a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PTEN</name>
              <description>PTEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMAEN</name>
          <displayName>PMAEN</displayName>
          <description>PMAEN</description>
          <addressOffset>0x60c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x47ff</resetMask>
          <fields>
            <field>
              <name>PTEN</name>
              <description>PTEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMSTAT</name>
          <displayName>PMSTAT</displayName>
          <description>PMSTAT</description>
          <addressOffset>0x60e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xcfcf</resetMask>
          <fields>
            <field>
              <name>OB0E</name>
              <description>OB0E</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMVAL</name>
          <displayName>ALRMVAL</displayName>
          <description>ALRMVAL</description>
          <addressOffset>0x620</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ALRMVAL</name>
              <description>ALRMVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALCFGRPT</name>
          <displayName>ALCFGRPT</displayName>
          <description>ALCFGRPT</description>
          <addressOffset>0x622</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>ARPT</name>
              <description>ARPT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCVAL</name>
          <displayName>RTCVAL</displayName>
          <description>RTCVAL</description>
          <addressOffset>0x624</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RTCVAL</name>
              <description>RTCVAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCFGCAL</name>
          <displayName>RCFGCAL</displayName>
          <description>RCFGCAL</description>
          <addressOffset>0x626</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>CAL</name>
              <description>CAL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMCON</name>
          <displayName>CMCON</displayName>
          <description>CMCON</description>
          <addressOffset>0x630</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xbfff</resetMask>
          <fields>
            <field>
              <name>C1POS</name>
              <description>C1POS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCON</name>
          <displayName>CVRCON</displayName>
          <description>CVRCON</description>
          <addressOffset>0x632</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>CVR</name>
              <description>CVR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCCON</name>
          <displayName>CRCCON</displayName>
          <description>CRCCON</description>
          <addressOffset>0x640</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0x3fff</resetMask>
          <fields>
            <field>
              <name>PLEN</name>
              <description>PLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCXOR</name>
          <displayName>CRCXOR</displayName>
          <description>CRCXOR</description>
          <addressOffset>0x642</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CRCXOR</name>
              <description>CRCXOR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDAT</name>
          <displayName>CRCDAT</displayName>
          <description>CRCDAT</description>
          <addressOffset>0x644</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CRCDAT</name>
              <description>CRCDAT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCWDAT</name>
          <displayName>CRCWDAT</displayName>
          <description>CRCWDAT</description>
          <addressOffset>0x646</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>CRCWDAT</name>
              <description>CRCWDAT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR0</name>
          <displayName>RPINR0</displayName>
          <description>RPINR0</description>
          <addressOffset>0x680</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f00</resetValue>
          <resetMask>0x1f00</resetMask>
          <fields>
            <field>
              <name>INT1R</name>
              <description>INT1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR1</name>
          <displayName>RPINR1</displayName>
          <description>RPINR1</description>
          <addressOffset>0x682</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>INT2R</name>
              <description>INT2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR3</name>
          <displayName>RPINR3</displayName>
          <description>RPINR3</description>
          <addressOffset>0x686</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>T2CKR</name>
              <description>T2CKR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR4</name>
          <displayName>RPINR4</displayName>
          <description>RPINR4</description>
          <addressOffset>0x688</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>T4CKR</name>
              <description>T4CKR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR7</name>
          <displayName>RPINR7</displayName>
          <description>RPINR7</description>
          <addressOffset>0x68e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>IC1R</name>
              <description>IC1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR10</name>
          <displayName>RPINR10</displayName>
          <description>RPINR10</description>
          <addressOffset>0x694</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>IC7R</name>
              <description>IC7R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR11</name>
          <displayName>RPINR11</displayName>
          <description>RPINR11</description>
          <addressOffset>0x696</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>OCFAR</name>
              <description>OCFAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR12</name>
          <displayName>RPINR12</displayName>
          <description>RPINR12</description>
          <addressOffset>0x698</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>FLTA1R</name>
              <description>FLTA1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR13</name>
          <displayName>RPINR13</displayName>
          <description>RPINR13</description>
          <addressOffset>0x69a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>FLTA2R</name>
              <description>FLTA2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR14</name>
          <displayName>RPINR14</displayName>
          <description>RPINR14</description>
          <addressOffset>0x69c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>QEA1R</name>
              <description>QEA1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR15</name>
          <displayName>RPINR15</displayName>
          <description>RPINR15</description>
          <addressOffset>0x69e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>INDX1R</name>
              <description>INDX1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR16</name>
          <displayName>RPINR16</displayName>
          <description>RPINR16</description>
          <addressOffset>0x6a0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>QEA2R</name>
              <description>QEA2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR17</name>
          <displayName>RPINR17</displayName>
          <description>RPINR17</description>
          <addressOffset>0x6a2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>INDX2R</name>
              <description>INDX2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
