xsession/openocd/svd/dspic33fj128mc804.svd
        <register>
          <name>RPINR18</name>
          <displayName>RPINR18</displayName>
          <description>RPINR18</description>
          <addressOffset>0x6a4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>U1RXR</name>
              <description>U1RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR19</name>
          <displayName>RPINR19</displayName>
          <description>RPINR19</description>
          <addressOffset>0x6a6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>U2RXR</name>
              <description>U2RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR20</name>
          <displayName>RPINR20</displayName>
          <description>RPINR20</description>
          <addressOffset>0x6a8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>SDI1R</name>
              <description>SDI1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR21</name>
          <displayName>RPINR21</displayName>
          <description>RPINR21</description>
          <addressOffset>0x6aa</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>SS1R</name>
              <description>SS1R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR22</name>
          <displayName>RPINR22</displayName>
          <description>RPINR22</description>
          <addressOffset>0x6ac</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f1f</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>SDI2R</name>
              <description>SDI2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR23</name>
          <displayName>RPINR23</displayName>
          <description>RPINR23</description>
          <addressOffset>0x6ae</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>SS2R</name>
              <description>SS2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPINR26</name>
          <displayName>RPINR26</displayName>
          <description>RPINR26</description>
          <addressOffset>0x6b4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1f</resetValue>
          <resetMask>0x1f</resetMask>
          <fields>
            <field>
              <name>C1RXR</name>
              <description>C1RXR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR0</name>
          <displayName>RPOR0</displayName>
          <description>RPOR0</description>
          <addressOffset>0x6c0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP0R</name>
              <description>RP0R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR1</name>
          <displayName>RPOR1</displayName>
          <description>RPOR1</description>
          <addressOffset>0x6c2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP2R</name>
              <description>RP2R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR2</name>
          <displayName>RPOR2</displayName>
          <description>RPOR2</description>
          <addressOffset>0x6c4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP4R</name>
              <description>RP4R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR3</name>
          <displayName>RPOR3</displayName>
          <description>RPOR3</description>
          <addressOffset>0x6c6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP6R</name>
              <description>RP6R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR4</name>
          <displayName>RPOR4</displayName>
          <description>RPOR4</description>
          <addressOffset>0x6c8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP8R</name>
              <description>RP8R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR5</name>
          <displayName>RPOR5</displayName>
          <description>RPOR5</description>
          <addressOffset>0x6ca</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP10R</name>
              <description>RP10R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR6</name>
          <displayName>RPOR6</displayName>
          <description>RPOR6</description>
          <addressOffset>0x6cc</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP12R</name>
              <description>RP12R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR7</name>
          <displayName>RPOR7</displayName>
          <description>RPOR7</description>
          <addressOffset>0x6ce</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP14R</name>
              <description>RP14R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR8</name>
          <displayName>RPOR8</displayName>
          <description>RPOR8</description>
          <addressOffset>0x6d0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP16R</name>
              <description>RP16R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR9</name>
          <displayName>RPOR9</displayName>
          <description>RPOR9</description>
          <addressOffset>0x6d2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP18R</name>
              <description>RP18R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR10</name>
          <displayName>RPOR10</displayName>
          <description>RPOR10</description>
          <addressOffset>0x6d4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP20R</name>
              <description>RP20R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR11</name>
          <displayName>RPOR11</displayName>
          <description>RPOR11</description>
          <addressOffset>0x6d6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP22R</name>
              <description>RP22R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RPOR12</name>
          <displayName>RPOR12</displayName>
          <description>RPOR12</description>
          <addressOffset>0x6d8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1f1f</resetMask>
          <fields>
            <field>
              <name>RP24R</name>
              <description>RP24R</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RCON</name>
          <displayName>RCON</displayName>
          <description>RCON</description>
          <addressOffset>0x740</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xc3ff</resetMask>
          <fields>
            <field>
              <name>POR</name>
              <description>POR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCON</name>
          <displayName>OSCCON</displayName>
          <description>OSCCON</description>
          <addressOffset>0x742</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x70eb</resetMask>
          <fields>
            <field>
              <name>OSWEN</name>
              <description>OSWEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <displayName>CLKDIV</displayName>
          <description>CLKDIV</description>
          <addressOffset>0x744</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x3040</resetValue>
          <resetMask>0xffdf</resetMask>
          <fields>
            <field>
              <name>PLLPRE</name>
              <description>PLLPRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLFBD</name>
          <displayName>PLLFBD</displayName>
          <description>PLLFBD</description>
          <addressOffset>0x746</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1ff</resetMask>
          <fields>
            <field>
              <name>PLLDIV</name>
              <description>PLLDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUN</name>
          <displayName>OSCTUN</displayName>
          <description>OSCTUN</description>
          <addressOffset>0x748</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3f</resetMask>
          <fields>
            <field>
              <name>TUN</name>
              <description>TUN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLKCON</name>
          <displayName>ACLKCON</displayName>
          <description>ACLKCON</description>
          <addressOffset>0x74a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ASRCSEL</name>
              <description>ASRCSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRAM</name>
          <displayName>BSRAM</displayName>
          <description>BSRAM</description>
          <addressOffset>0x750</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>RL_BSR</name>
              <description>RL_BSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSRAM</name>
          <displayName>SSRAM</displayName>
          <description>SSRAM</description>
          <addressOffset>0x752</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>RL_SSR</name>
              <description>RL_SSR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCON</name>
          <displayName>NVMCON</displayName>
          <description>NVMCON</description>
          <addressOffset>0x760</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xe04f</resetMask>
          <fields>
            <field>
              <name>NVMOP</name>
              <description>NVMOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMKEY</name>
          <displayName>NVMKEY</displayName>
          <description>NVMKEY</description>
          <addressOffset>0x766</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xff</resetMask>
          <fields>
            <field>
              <name>NVMKEY</name>
              <description>NVMKEY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD1</name>
          <displayName>PMD1</displayName>
          <description>PMD1</description>
          <addressOffset>0x770</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xf8fb</resetMask>
          <fields>
            <field>
              <name>AD1MD</name>
              <description>AD1MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2</name>
          <displayName>PMD2</displayName>
          <description>PMD2</description>
          <addressOffset>0x772</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xc30f</resetMask>
          <fields>
            <field>
              <name>OC1MD</name>
              <description>OC1MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD3</name>
          <displayName>PMD3</displayName>
          <description>PMD3</description>
          <addressOffset>0x774</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7c0</resetMask>
          <fields>
            <field>
              <name>PWM2MD</name>
              <description>PWM2MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>